index.org
# -*- coding:utf-8-*-
#+TITLE: 简历
#+AUTHOR: liushangliang
#+EMAIL: phenix3443@gmail.com
#+OPTIONS: toc:nil author:nil date:nil creator:nil timestamp:nil validate:nil

* 联系方式
-----
#+ATTR_HTML:  :rules none :frame void
| QQ     | 344300476                          |
| Tel    | 153-3879-6096                      |
| Email  | phenix3443@gmail.com               |
| GitHub | https://github.com/phenix3443      |
| Home   | https://phenix3443.github.io/      |
| 豆瓣   | http://.douban.com/people/2106771/ |

* 教育经历
-----

#+ATTR_HTML:  :rules none :frame void
| 2010.9 ~ 2013.1 | 中国科技大学   | 软件工程信息安全（硕士）   |
| 2005.9 ~ 2009.7 | 哈尔滨工业大学 | 计算机信息安全专业（学士） |


* 个人项目
-----
+ http://phenix3443.github.io/notebook
  + 项目背景：个人博客
  + 涉及技术：org-mode  github-page git
  + 主要任务：记录和更新自己的技术积累和读书笔记，使用 git 进行版本管理，Emacs Org-mode 进行编写，并发布 github。

* 工作经验
-----
+ 迅雷网络有限公司（2015.12 ~ 今）
  - 原高速离线系统项目维护
    + 主要任务：负责原先高速离线服务的日常维护和项目开发，包括高速加速、高速试用、高速通道、高速明细、资源索引、高速场景、高速鉴权等服务。
    + 主要技术：C++，Lua, Python, Openresty，MySQL，Redis，Docker，falcon，Confluence，JIRA，TCPCopy。
    + 主要贡献：
      + 保证原有服务的正常运行。
      + 负责原先高速离线服务的服务迁移工作，并在后续服务迁移过程中进行了大量整理工作，包括：
        + 梳理项目代码，使用Docker搭建了统一的编译环境，使用CMake等工具规范了项目的编译打包流程。
        + 规范项目部署，整理出一套通用的项目部署结构，规范线上项目部署。参见 [[https://github.com/phenix3443/project_layout][project-layout]] 。
        + 完善项目文档，针对项目流程、协议接口、数据库结构、生产测试环境、服务间依赖关系、上线监控事项等在Confluence系统做了记录，方便后续的开发维护工作。
        + 完善监控系统，针对迁移过程中发现的监控不全、不实时的问题，使用open-falcon实时监控系统和服务运行状况。
        + 开发协议解析器，针对原有服务使用的二进制协议开发了协议解析器，编写服务的接口测试，保证迁移工作的顺利和线上服务的可用性.

  - 新高速离线系统开发
    + 主要任务：负责新版高速离线系统开发和维护，包括新版高速加速、高速试用、高速鉴权、资源索引、离线下载、离线空间、测速服务、资源爬虫等系统。
    + 主要技术：C++，Lua，Python，Golang，Openresty，MySQL，Redis，Docker，CMake，gRPC，SSDB，Scrapy。
    + 主要贡献：
      + 实现二进制协议解析器，基于该解析器，为大部分接口添加了接口测试用例。
      + 对接新版DCDN加速系统，并对其代码进行了部分重构，方便进行单元测试。
      + 对DCDN加速系统存储部分重构，保证加速资源记录的完整性和可靠性。
      + 新版加速系统资源调度优化，日均2.4PB资源调度（去重后）。
      + 部署爬虫采集线上资源，加快热门资源的采集部署，保证相关资源更新被及时采集到。
      + 使用测试框架（GTest,GMock,LuaUnit,Gocheck等）编写代码单元测试，保证代码质量。
      + 使用Docker Compose建立闭环的测试环境。
      + 所有项目模块化，通过设置模块开关、服务降级等手段保证服务的稳定性和可用性。
      + 项目的测试工作和规范部署为后续持续集成做了良好准备。

  - 触达系统
    + 项目背景：定向推送触达消息，引导用户充值消费。
    + 主要任务：重构原先的触达系统。
    + 涉及技术：Openresty、Python、Redis、MySQL、Docker、Robot Framework、gRPC。
    + 主要贡献：
      + 新增客户端弹窗、邮件、微信、短信等多种推送渠道。
      + 日均触达信息从40多万条上升到200多万条，日均收入从6万提高到14万。
      + 通过重构简化触达消息管理流程，简化了操作，加快新触达信息部署速度。

  - 其他
    + 开发了自动登录工具和部署工具，方便平时个人开发、测试和项目部署。
    + 推进项目规范化，数据可视化，测试自动化，可持续部署等。


+ 深圳尚游游戏有限公司（2014 ~ 2015）
  + 手游服务端开发。


+ 深圳普联技术有限公司（2013 ~ 2014）
  + 路由器开发。


+ 思科中国杭州研发中心（2011 ~ 2012）
  + 实习。
